let handler = async (m, { conn }) => {
let tag = `${conn.getName(m.sender)}`;
 let txt = `*╭━━━━━━━━⋆⋆━━━━━━━━─*
*┃➤* 👋🏻 𝙃𝙊𝙇𝘼, 𝙃𝙐𝙈𝘼𝙉𝙊
*┃➤* *${usuario}*
*┃➤* 𝙎𝙊𝙔 𝙀𝙇𝘿𝙀𝙍-𝘽𝙊𝙏 👨🏻‍💻
*╰━━━━━━━━⋆⋆━━━━━━━━─*

» 𝘉𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘰, 𝘦𝘴𝘵𝘦 𝘦𝘴 𝘶𝘯 𝘮𝘦𝘯𝘶́ 𝘳𝘦𝘴𝘶𝘮𝘪𝘥𝘰 𝘥𝘦 𝘵𝘰𝘥𝘰 𝘭𝘰 𝘲𝘶𝘦 𝘤𝘰𝘯𝘵𝘪𝘦𝘯𝘦 𝘌𝘭𝘥𝘦𝘳-𝘣𝘰𝘵.

╭── ⬣ *\`「 𝙄𝙣𝙛𝙤 」\`*❗
│👨🏻‍💻 .𝘗𝘦𝘳𝘧𝘪𝘭
│👨🏻‍💻 .𝘔𝘦𝘯𝘶
│👨🏻‍💻 .𝘔𝘦𝘯𝘶𝘩𝘰𝘵
│👨🏻‍💻 .𝘔𝘦𝘯𝘶2
│👨🏻‍💻 .𝘔𝘦𝘯𝘶3
│👨🏻‍💻 .𝘔𝘦𝘯𝘶𝘧𝘧
│👨🏻‍💻 .𝘚𝘵𝘢𝘧𝘧
│👨🏻‍💻  𝘌𝘴𝘵𝘢𝘥𝘰
│👨🏻‍💻 .𝘗𝘳𝘦𝘤𝘪𝘰𝘴1
│👨🏻‍💻 .𝘗𝘳𝘦𝘤𝘪𝘰𝘴2
│👨🏻‍💻 .𝘖𝘸𝘯𝘦𝘳
│👨🏻‍💻 .𝘛𝘰𝘵𝘢𝘭𝘧𝘶𝘯𝘤𝘪𝘰𝘯𝘦𝘴
│👨🏻‍💻.𝘣𝘰𝘵𝘳𝘦𝘨𝘭𝘢𝘴
╰── ⬣

╭── ⬣ *\`「 𝘽𝙪𝙨𝙦𝙪𝙚𝙙𝙖𝙨 」\`*🔎
│🕵🏻‍♂️ .𝘗𝘪𝘯𝘴𝘤𝘳𝘰𝘭𝘭 *<ʙᴜ́sǫᴜᴇᴅᴀ>*
│🕵🏻‍♂️ .𝘗𝘪𝘯𝘴𝘦𝘨𝘶𝘪𝘳
│🕵🏻‍♂️ .𝘗𝘪𝘯𝘢𝘵𝘳𝘢𝘴
│🕵🏻‍♂️ .𝘠𝘵𝘴𝘦𝘢𝘳𝘤𝘩 *<ᴛxᴛ>*
│🕵🏻‍♂️ .𝘛𝘬𝘴𝘦𝘢𝘳𝘤𝘩 *<ᴛxᴛ>*
│🕵🏻‍♂️ .𝘛𝘬𝘴𝘦𝘨𝘶𝘪𝘳
│🕵🏻‍♂️ .𝘕𝘦𝘬𝘰
│🕵🏻‍♂️ .𝘞𝘢𝘪𝘧𝘶
│🕵🏻‍♂️ .𝘉𝘪𝘣𝘭𝘪𝘢 *<ʀᴇғᴇʀᴇɴᴄɪᴀ>*
│🕵🏻‍♂️ .𝘗𝘪𝘯𝘵𝘦𝘳𝘦𝘴𝘵
│🕵🏻‍♂️ .𝘞𝘪𝘬𝘪𝘱𝘦𝘥𝘪𝘢
│🕵🏻‍♂️ .𝘎𝘰𝘰𝘨𝘭𝘦
│🕵🏻‍♂️ .𝘔𝘦𝘳𝘤𝘢𝘥𝘰𝘭𝘪𝘣𝘳𝘦
│🕵🏻‍♂️ .𝘛𝘸𝘦𝘦𝘵𝘰𝘰𝘴𝘵𝘴
╰── ⬣

╭── ⬣ *\`「 𝙂𝙧𝙪𝙥𝙤𝙨」\`* 👥
│⚙️ .𝘎𝘳𝘶𝘱𝘰 𝘢𝘣𝘳𝘪𝘳/𝘤𝘦𝘳𝘳𝘢𝘳
│⚙️ .𝘐𝘯𝘷𝘪𝘵𝘢𝘳 *<ɴᴜ́ᴍᴇʀᴏ>*
│⚙️ .𝘉𝘢𝘯 *<@ᴛᴀɢ>*
│⚙️ .𝘙𝘶𝘭𝘦𝘵𝘢𝘣𝘢𝘯
│⚙️ .𝘗𝘳𝘰𝘮𝘰𝘵𝘦 *<@ᴛᴀɢ>*
│⚙️ .𝘋𝘦𝘮𝘰𝘵𝘦 *< @ᴛᴀɢ>*
│⚙️ .𝘛𝘰𝘥𝘰𝘴
│⚙️ .𝘕𝘰𝘵𝘪𝘧𝘺
│⚙️ .𝘓𝘪𝘯𝘬
│⚙️ .𝘚𝘦𝘵𝘸𝘦𝘭𝘤𝘰𝘮𝘦
│⚙️ .𝘚𝘦𝘵𝘣𝘺𝘦
│⚙️ .𝘔𝘶𝘵𝘦
│⚙️ .𝘜𝘯𝘮𝘶𝘵𝘦
│⚙️ .𝘚𝘰𝘳𝘵𝘦𝘰
│⚙️ .𝘈𝘧𝘬 *<ᴛxᴛ>*
╰── ⬣

╭── ⬣ *\`「 𝙊𝙬𝙣𝙚𝙧 」\`* 👑
│👑 .𝘉𝘢𝘯𝘤𝘩𝘢𝘵
│👑 .𝘜𝘯𝘣𝘢𝘯𝘤𝘩𝘢𝘵
│👑 .𝘉𝘢𝘯𝘶𝘴𝘦𝘳 *<@ᴛᴀɢ>*
│👑 .𝘜𝘯𝘣𝘢𝘯𝘶𝘴𝘦𝘳 *< @ᴛᴀɢ>*
│👑 .𝘋𝘴𝘰𝘸𝘯𝘦𝘳
│👑 .𝘔𝘣𝘢𝘯
│👑 .𝘚𝘱𝘢𝘮2
│👑 .𝘙𝘦𝘶𝘯𝘪𝘰𝘯
│👑 .𝘙𝘦𝘶𝘯𝘪𝘰𝘯𝘴𝘵𝘢𝘧𝘧
│👑 .𝘜𝘱𝘥𝘢𝘵𝘦
│👑 .𝘊𝘩𝘦𝘵𝘢𝘳
│👑 .𝘈𝘶𝘵𝘰𝘢𝘥𝘮𝘪𝘯
│👑 .𝘑𝘰𝘪𝘯
╰── ⬣

╭── ⬣ *\`「 𝙊𝙉/𝙊𝙁𝙁 」\`*📌
│🌪️ .𝘖𝘯/𝘖𝘧𝘧
│🌪️ .𝘌𝘯𝘢𝘣𝘭𝘦/𝘋𝘪𝘴𝘢𝘣𝘭𝘦
╰── ⬣

╭── ⬣ *\`「 𝘿𝙚𝙨𝙘𝙖𝙧𝙜𝙖𝙨 」\`* 💫
│🎯 .𝘚𝘱𝘰𝘵𝘪𝘧𝘺
│🎯 .𝘠𝘵𝘢
│🎯 .𝘠𝘵𝘮𝘱3
│🎯 .𝘠𝘵𝘮𝘱4
│🎯 .𝘗𝘭𝘢𝘺
│🎯 .𝘗𝘭𝘢𝘺2
│🎯 .𝘠𝘵𝘷
│🎯 .𝘛𝘪𝘬𝘵𝘰𝘬2 *<ʟɪɴᴋ>*
│🎯 .𝘛𝘪𝘬𝘵𝘰𝘬 *<ʟɪɴᴋ>*
│🎯 .𝘛𝘪𝘬𝘵𝘰𝘬𝘮𝘱3 *<ʟɪɴᴋ>*
│🎯 .𝘐𝘨 *<ʟɪɴᴋ>*
│🎯 .𝘍𝘢𝘤𝘦𝘣𝘰𝘰𝘬 *<ʟɪɴᴋ>*
│🎯 .𝘛𝘵𝘮𝘱3
│🎯 .𝘈𝘱𝘬
│🎯 .𝘈𝘱𝘬2
│🎯 .𝘔𝘦𝘥𝘪𝘢𝘧𝘪𝘳𝘦
╰── ⬣

╭── ⬣ *\`「 𝘾𝙤𝙣𝙫𝙚𝙧𝙩𝙞𝙙𝙤𝙧𝙚𝙨 」\`* ⚔️
│🌐 .𝘏𝘥
│🌐 .𝘛𝘰𝘶𝘳𝘭
│🌐 .𝘋𝘢𝘭𝘭𝘦
│🌐 .𝘙𝘦𝘤
│🌐 .𝘗𝘪𝘯𝘢𝘵𝘳𝘢𝘴
│🌐 .𝘍𝘭𝘶𝘹
│🌐 .𝘗𝘪𝘯𝘴𝘦𝘨𝘶𝘪𝘳
│🌐 .𝘚𝘦𝘵𝘣𝘢𝘯𝘯𝘦𝘳
│🌐 .𝘚𝘦𝘵𝘯𝘢𝘮𝘦
│🌐 .𝘵𝘵𝘴
│🌐 .𝘋𝘦𝘮𝘰
│🌐 .𝘛𝘰𝘮𝘱3
│🌐 .𝘙𝘦𝘮𝘰𝘷𝘦𝘣𝘨
╰── ⬣

╭── ⬣ *\`「  𝙎𝙩𝙞𝙘𝙠𝙚𝙧𝙨  」\`* 🎭
│🎭 .𝘉𝘳𝘢𝘵𝘪
│🎭 .𝘚
│🎭 .𝘘𝘤
│🎭 .𝘈𝘵𝘵𝘱
│🎭 .𝘌𝘮𝘰𝘫𝘪𝘮𝘪𝘹
│🎭 .𝘞𝘮
│🎭 .𝘚𝘤𝘢𝘵
│🎭 .𝘗𝘧𝘱
╰── ⬣

╭── ⬣ *\`「  𝙅𝙪𝙚𝙜𝙤𝙨  」\`* 🎮
│🕹️ .𝘊𝘙7
│🕹️ .𝘔𝘦𝘴𝘴𝘪
│🕹️ .𝘎𝘢𝘺
│🕹️ .𝘗𝘶𝘵𝘢
│🕹️ .𝘗𝘶𝘵𝘰
│🕹️ .𝘗𝘦𝘳𝘳𝘢
│🕹️ .𝘔𝘢𝘯𝘤𝘰
│🕹️ .𝘔𝘢𝘯𝘤𝘢
│🕹️ .𝘡𝘰𝘳𝘳𝘢
│🕹️ .𝘉𝘦𝘴𝘢𝘳
│🕹️ .𝘈𝘣𝘳𝘢𝘻𝘢𝘳
│🕹️ .𝘝𝘪𝘰𝘭𝘢𝘳
│🕹️ .𝘚𝘢𝘱𝘰
│🕹️ .𝘚𝘢𝘱𝘢
│🕹️ .𝘛𝘰𝘤𝘢𝘳
│🕹️ .𝘋𝘢𝘥𝘰
│🕹️ .𝘎𝘢𝘺2
│🕹️ .𝘗𝘢𝘫𝘦𝘳𝘰
│🕹️ .𝘗𝘢𝘫𝘦𝘳𝘢
│🕹️ .𝘓𝘦𝘴𝘣𝘪𝘢𝘯𝘢
│🕹️ .𝘙𝘢𝘵𝘢
│🕹️ .𝘗𝘳𝘰𝘴𝘵𝘪𝘵𝘶𝘵𝘢
│🕹️ .𝘍𝘰𝘭𝘭𝘢𝘳
│🕹️ .𝘍𝘰𝘳𝘮𝘢𝘳𝘵𝘳𝘪𝘰
│🕹️ .𝘍𝘰𝘳𝘮𝘢𝘳𝘱𝘢𝘳𝘦𝘫𝘢
│🕹️ .𝘍𝘰𝘳𝘮𝘢𝘳𝘱𝘢𝘳𝘦𝘫𝘢5
│🕹️ .𝘍𝘢𝘤𝘵𝘰
│🕹️ .𝘔𝘢𝘳𝘳𝘺
│🕹️ .𝘋𝘪𝘷𝘰𝘳𝘤𝘦
│🕹️ .𝘗𝘢𝘫𝘦𝘢𝘮𝘦
│🕹️ .𝘗𝘢𝘫𝘢
│🕹️ .𝘛𝘰𝘱
╰── ⬣

╭── ⬣ *\`「  𝙂𝙖𝙢𝙚  」\`* 🎮
│🎮 .𝘗𝘦𝘭𝘦𝘢𝘳
│🎮 .𝘊𝘢𝘱𝘪𝘵𝘢𝘭𝘥𝘦
│🎮 .𝘎𝘢𝘮𝘦
│🎮 .𝘚𝘭𝘰𝘵
│🎮 .𝘛𝘳𝘪𝘷𝘪𝘢
│🎮 .𝘉𝘶𝘴𝘤𝘢𝘳𝘱𝘢𝘭𝘢𝘣𝘳𝘢𝘴
│🎮 .𝘚𝘰𝘱𝘢
│🎮 .𝘋𝘢𝘥𝘰
│🎮 .𝘈𝘩𝘰𝘳𝘤𝘢𝘥𝘰
│🎮 .𝘈𝘥𝘪𝘷𝘪𝘯𝘢𝘳𝘣𝘢𝘯𝘥𝘦𝘳𝘢
╰── ⬣
> *© ⍴᥆ᥕᥱrᥱძ ᑲᥡ һᥒ ᥱᥣძᥱr*`.trim();

m.react('🔰');
let perfil = await conn.profilePictureUrl(m.sender, 'image').catch(_ => 'https://i.ibb.co/5xMs19nx/file.jpg');

/* await conn.sendMessage(m.chat, { text: txt, contextInfo: { externalAdReply: { title: botname, body: dev, thumbnailUrl: banner, mediaType: 1, showAdAttribution: true, renderLargerThumbnail: true }}} , { quoted: m })
};
*/
let bann = 'https://cdnmega.vercel.app/media/9wB1HLrT@Jcn5yrz18NjokOpmyK-SS9u-OZc4SyK_2rsVxxQ6wXI';

conn.sendMessage(m.chat, { image: { url: bann }, caption: txt }, { quoted: m });
}

handler.command = ['allmenu', 'menu', 'menuall', 'menucompleto'];

export default handler;